// Что выведет console.log (ИЛИ)?
// Что выведет код ниже?

console.log(null || 2 || undefined); // 2 поскольок null == false

// Что выведет console.log (ИЛИ)?
// Что выведет код ниже?

console.log(1) || 2 || console.log(3); // 1 поскольку первое true значение. далее программа останавливается

// Что выведет console.log (И)?
// Что выведет код ниже?

console.log(1 && null && 2); // выражение не true, поэтому возвращается первое ложное значение

// Что выведет console.log (И)?
// Что выведет код ниже?

console.log(1) && console.log(2); // 1 посколько первое истинное значение

// Что выведет этот код?
// Что выведет код ниже?

console.log(null || (2 && 3) || 4); // 3 - первое ложное

// Что выведет этот код (||=, &&=)?
// Что выведет код ниже?

let value = NaN;

value &&= 10;
value ||= 20;
// value &&= 30;
value ||= 40;

console.log(value); // 30. Оператор И имеет самый большой приоритет. сначала назначается 20. потом 30


