// Задача 1: Сравнение чисел
5 > 4 // true
"ананас" > "яблоко" // false
"2" > "12" // true
undefined == null // true
undefined === null // false
null == "\n0\n" // false
null === +"\n0\n"// false

// Задача 2: Сравнение чисел

// Напишите код, который сравнивает два числа и выводит в консоль, какое из них больше, меньше или равны ли они.

let a = 5;
let b = 10;

function biggerNum(a, b) {
    let result = (a > b) ? a : (a < b) ? b : ('numbers are equal')
    return result;
}
console.log(biggerNum(a, b))



// Задача 3: Проверка типов

// Создайте две переменные, одну с числом, а другую со строкой, содержащей то же самое число. Используйте оператор строгого равенства (===) и нестрогого равенства (==), чтобы проверить, равны ли они, и выведите результаты в консоль.

let num = 5;
let str = "5";

console.log(num == str) // true
console.log(num === str) // false


// Задача 4: Возраст

// Напишите функцию checkAge, которая принимает возраст (число) и возвращает строку: "Вы совершеннолетний", если возраст больше или равен 18, и "Вы несовершеннолетний" в противном случае.

function checkAge(age) {
    return (age > 18) ? "Вы совершеннолетний" : "Вы несовершеннолетний";
}

// Примеры вызова функции
console.log(checkAge(20)); // "Вы совершеннолетний"
console.log(checkAge(16)); // "Вы несовершеннолетний"


// ▎Задача 5: Сравнение строк

// Создайте две строки и сравните их с помощью операторов сравнения. Выведите в консоль результат сравнения на равенство и неравенство.

let str1 = "Hello";
let str2 = "hello";
let str3 = "3";

console.log( str1 > str2 ) // false
console.log( str1 < str2 ) // true
console.log( str1 > str3 ) // true

// ▎Задача 6: Проверка четности

// Напишите функцию isEven, которая принимает число и возвращает true, если оно четное, и false, если нечетное. Используйте оператор остатка от деления (%) для проверки.

function isEven(num) {
    return (num % 2) ? false : true
 }

// Примеры вызова функции
console.log(isEven(4)); // true
console.log(isEven(5)); // false


// ▎Задача 7: Сравнение массивов

// Создайте два массива с одинаковыми значениями и сравните их с помощью операторов == и ===. Объясните результаты.

let arr1 = [1, 2, 3];
let arr2 = [1, 2, 3];

console.log(arr1 == arr2) // false 
console.log(arr1 === arr2) // false //в обоих случаях мы сравниваем ссылки на объекты. разные ссылки = разные объекты


// ▎Задача 8: Сравнение объектов

// Создайте два объекта с одинаковыми свойствами и значениями. Попробуйте сравнить их с помощью операторов == и ===. Объясните, почему результат может быть неожиданным.

let obj1 = { name: "Alice" };
let obj2 = { name: "Alice" };

console.log(obj1 == obj2) // false
console.log(obj1 === obj2) // false //в обоих случаях мы сравниваем ссылки на объекты. разные ссылки = разные объекты


